# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install GNU utilities
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'moreutils'
brew 'openssh'
brew 'osxutils'
brew 'tree'
brew 'wget'

# Update git and install utilities
brew 'ccat'
brew 'git'
brew 'git-extras'
brew 'highlight'
brew 'mackup'
brew 'wifi-password'

# Brew Dev tools
brew 'fish'
brew 'chisel'
brew 'httpie'
brew 'htop'
brew 'nvm' # Node and Rails
brew 'python'
brew 'rbenv'
brew 'ruby-build'
brew 'swiftformat'
brew 'swiftgen'
# brew 'swiftlint'
brew 'tldr'

# Casks
cask '1password'
cask 'alfred'
cask 'arc'
cask 'bunch'
cask 'contexts'
cask 'imagealpha'
cask 'imageoptim'
cask 'keyboard-maestro'
cask 'rocket'
cask 'steermouse'

# Casks Dev tools
cask 'devtoys'
cask 'espanso'
cask 'iterm2'
cask 'kaleidoscope'
cask 'paw'
cask 'periphery'
cask 'xcodes'
cask 'sf-symbols'
cask 'sublime-text'
cask 'tower'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'wwdc'

# Quicklook Plugins
cask 'betterzip'
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-anonymous-pro'
cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'

# Mac App Store Apps
mas '1Blocker', id: 1365531024
mas 'Buildwatch', id: 1523347474
mas 'Clockify Desktop', id: 1364502317
mas 'DaisyDisk', id: 411643860
mas 'Dato', id: 1470584107
mas 'DevCleaner', id: 1388020431
mas 'Developer', id: 640199958
mas 'Drafts', id: 1435957248
mas 'Expressions', id: 913158085
mas 'InjectionIII', id: 1380446739
mas 'LanguageTool', id: 1534275760
mas 'Magnet', id: 441258766
mas 'Marked 2', id: 890031187
mas 'Meeter', id: 1510445899
mas 'Notchmeister', id: 1599169747
mas 'Pixelmator', id: 407963104
mas 'SnippetsLab', id: 1006087419
mas 'Soulver 3', id: 1508732804
mas 'StopTheMadness', id: 1376402589
mas 'Super Agent', id: 1568262835
mas 'TabsToLinks', id: 1451408472
mas 'TestFlight', id: 899247664
mas 'The Unarchiver', id: 425424353
mas 'Toolkit for YNAB', id: 1592912837
mas 'ToothFairy', id: 1191449274
mas 'Tot', id: 1491071483
mas 'Tweetbot', id: 1384080005
mas 'Velja', id: 1607635845
mas 'Vimari', id: 1480933944
mas 'xcsort', id: 1153337296
