# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'hombrew/fuse'

# Install GNU utilities
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'tree'
brew 'wget'
brew 'grep'
brew 'openssh'
brew 'osxutils'

# Update git and install utilities
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'wifi-password'
brew 'httpie'
brew 'ccat'
brew 'highlight'

# Intall shells
brew 'zsh'
brew 'zsh-completions'
brew 'fish'
brew 'bash'

# Dev tools
brew 'xcenv' # Install Xcode helpers
brew 'nvm' # Node and Rails
brew 'python'

# Settings backup
brew 'mackup' 

# Casks
cask '1password-beta'
cask 'dropbox'
cask 'imageoptim'
cask 'imagealpha'
cask 'iterm2'
cask 'atom'
cask 'google-chrome'
cask 'tower'
cask 'franz'
cask 'spotify'
cask 'alfred'
cask 'realm-browser'
cask 'safari-technology-preview'
cask 'nvalt'
cask 'tunnelblick-beta'
cask 'fastlane'
cask 'garmin-express'
cask 'insomnia'
cask 'macvim'
cask 'osxfuse'

# SSH File System
brew 'sshfs' #this has to be installed after osxfuse

# Quicklook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'provisionql'

# Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-hack'
cask 'font-anonymous-pro'

# Mac App Store Apps
mas 'Tweetbot', id: 557168941
mas 'Expressions', id: 913158085
mas '1Blocker', id: 1107421413
mas 'DayOne', id: 1055511498
mas 'aText', id: 488566438
mas '2Do', id: 477670270
mas 'Syntra', id: 1094640838
mas 'TextWrangler', id: 404010395
mas 'Boom2', id: 948176063
mas 'Magnet', id: 441258766
mas 'Marked 2' id: 890031187
