# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install GNU utilities
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'tree'
brew 'wget'
brew 'grep'
brew 'openssh'
brew 'osxutils'

# Update git and install utilities
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'wifi-password'
brew 'httpie'
brew 'ccat'
brew 'highlight'

# Intall shells
brew 'zsh'
brew 'zsh-completions'
brew 'fish'
brew 'bash'

# Dev tools
brew 'xcenv' # Install Xcode helpers
brew 'nvm' # Node and Rails
brew 'python'
brew 'swiftlint'
brew 'swiftgen'
brew 'cocoapods'
brew 'carthage'
brew 'chisel'
brew 'rbenv'
brew 'ruby-build'
brew 'sshrc' # ssh thah loads rc files on remote hosts
brew 'htop'
brew 'tldr'

# Settings backup
brew 'mackup'

# Casks
cask '1password'
cask 'dropbox'
cask 'imageoptim'
cask 'imagealpha'
cask 'iterm2'
cask 'visual-studio-code'
cask 'tower3'
cask 'kaleidoscope'
cask 'alfred'
cask 'nvalt'
cask 'tunnelblick'
cask 'insomnia'
cask 'macvim'
cask 'osxfuse'
cask 'hyper'
cask 'sip'
cask 'shuttle'
cask 'rocket'
cask 'vanilla'
cask 'setapp'
cask 'keyboard-maestro'

# SSH File System
#brew 'sshfs' #this has to be installed after osxfuse

# Quicklook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'provisionql'

# Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-hack'
cask 'font-anonymous-pro'
cask 'font-cascadia'

# Mac App Store Apps
mas '1Blocker', id: 1107421413
mas '2Do', id: 477670270
mas 'DayOne', id: 1055511498
mas 'Dropzone 3', id:695406827
mas 'Expressions', id: 913158085
mas 'Magnet', id: 441258766
mas 'Marked 2', id: 890031187
mas 'Quests', id: 1447415753
mas 'Slack', id:803453959
mas 'StopTheMadness', id: 1376402589
mas 'TabsToLinks', id: 1451408472
mas 'ToothFairy', id: 1191449274
mas 'Tweetbot3', id: 1384080005
